performance-test-reports/publish-mobile-n-load-test-report/12532453686/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2404      ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 170 kB  2.8 kB/s
-    group_duration.................: avg=11.67ms  min=3.47ms   med=4.28ms   max=842.04ms p(90)=4.8ms    p(95)=5.84ms  
-    http_req_blocked...............: avg=249.08µs min=162.66µs med=251.02µs max=608.47µs p(90)=284.65µs p(95)=296.19µs
-    http_req_connecting............: avg=183.37µs min=108.97µs med=185.05µs max=383.28µs p(90)=215.4µs  p(95)=221.28µs
-  ✓ http_req_duration..............: avg=10.43ms  min=2.51ms   med=3.04ms   max=840.8ms  p(90)=3.44ms   p(95)=4.35ms  
-      { expected_response:true }...: avg=10.43ms  min=2.51ms   med=3.04ms   max=840.8ms  p(90)=3.44ms   p(95)=4.35ms  
-  ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 601  
-    http_req_receiving.............: avg=84.68µs  min=44.84µs  med=84.71µs  max=150.57µs p(90)=106.73µs p(95)=111.19µs
-    http_req_sending...............: avg=48.48µs  min=24.89µs  med=46.41µs  max=220.8µs  p(90)=62.13µs  p(95)=67.91µs 
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=10.29ms  min=2.4ms    med=2.9ms    max=840.67ms p(90)=3.29ms   p(95)=4.21ms  
-    http_reqs......................: 601     10.014232/s
-    iteration_duration.............: avg=11.75ms  min=3.51ms   med=4.37ms   max=842.12ms p(90)=4.87ms   p(95)=5.9ms   
-    iterations.....................: 601     10.014232/s
-    vus............................: 0       min=0       max=4  
-    vus_max........................: 200     min=200     max=200